IdeaRS.OpenModel.Connection.IdeaConImportSettings
Represents settings of improt options into Idea Connections

IdeaRS.OpenModel.Connection.IdeaConImportSettings.#ctor
Constructor - it sets default values

IdeaRS.OpenModel.Connection.IdeaConImportSettings.UseWizard
Open import wizard window

IdeaRS.OpenModel.Connection.IdeaConImportSettings.DefaultBoltAssembly
Gets or sets the name of the default bolt assembly

IdeaRS.OpenModel.Connection.IdeaConImportSettings.DefaultSteelMaterial
Gets or sets the name of the default material of plates which are added from the template

IdeaRS.OpenModel.Connection.IdeaConImportSettings.ExportAllLinearCombination
All linear combination will be exported to IDEA connection

IdeaRS.OpenModel.Connection.IdeaConImportSettings.OnePageWizard
One page wizard

IdeaRS.OpenModel.Connection.IdeaConImportSettings.ConnectionFileName
Gets or sets the name of the Connection project

IdeaRS.OpenModel.Connection.IdeaConImportSettings.WaitForExit
WaitForExit

IdeaRS.OpenModel.Connection.IdeaConImportSettings.CanChangeDesignCodeInWizard
Can change design code in Wizard

IdeaRS.OpenModel.Connection.IdeaConImportSettings.UserWizardBrand
Set user Wizard Brand

IdeaRS.OpenModel.Connection.IdeaConImportSettings.RunningApplication
Running application

IdeaRS.OpenModel.Connection.IdeaConImportSettings.DesignCode
Gets or sets the Design Code

IdeaRS.OpenModel.Connection.IdeaConImportSettings.DefaultWeldMaterial
Gets or sets the name of the default weld material